test-vpc.yaml
---
settings:
  env:
    RIAS_REGION: eu-de
    RIAS_VERSION: 2022-07-05
    THINK_TIME: 5s

execution:
- concurrency: 30
  ramp-up: 1m
  hold-for: 5m
  scenario: vpc_test

scenarios:
  iam_auth:
    data-sources:
    - path: apikey.csv
      variable-names: apikey
      delimiter: ','
    requests:
    - url: https://iam.cloud.ibm.com/identity/token
      method: POST
      headers:
        Content-Type: application/x-www-form-urlencoded
        Accept: application/json
      body:
        grant_type: urn:ibm:params:oauth:grant-type:apikey
        apikey: ${apikey}
        response_type: cloud_iam
      extract-jsonpath:
        auth_token:
          jsonpath: $.access_token
      label: get_token
      jsr223: props.put('auth_token', 'Bearer ' + vars.get('auth_token'))
  vpc_public_instances:
    requests:
    - url: https://${RIAS_REGION}.iaas.cloud.ibm.com/v1/instances?version=${RIAS_VERSION}&generation=2&limit=99&sort=name
      method: GET
      headers:
        Content-Type: application/json
        Accept: application/json
        Authorization: ${__P(auth_token)}
      label: get_public_instances
      think-time: ${THINK_TIME}
  vpc_private_instances:
    requests:
    - url: https://private-${RIAS_REGION}.iaas.cloud.ibm.com/v1/instances?version=${RIAS_VERSION}&generation=2&limit=99&sort=name
      method: GET
      headers:
        Content-Type: application/json
        Accept: application/json
        Authorization: ${__P(auth_token)}
      label: get_private_instances
      think-time: ${THINK_TIME}
  vpc_public_lbs:
    requests:
    - url: https://${RIAS_REGION}.iaas.cloud.ibm.com/v1/load_balancers?version=${RIAS_VERSION}&generation=2&limit=99&sort=name'
      method: GET
      headers:
        Content-Type: application/json
        Accept: application/json
        Authorization: ${__P(auth_token)}
      label: get_public_lbs
      think-time: ${THINK_TIME}
  vpc_private_lbs:
    requests:
    - url: https://private-${RIAS_REGION}.iaas.cloud.ibm.com/v1/load_balancers?version=${RIAS_VERSION}&generation=2&limit=99&sort=name'
      method: GET
      headers:
        Content-Type: application/json
        Accept: application/json
        Authorization: ${__P(auth_token)}
      label: get_private_lbs
      think-time: ${THINK_TIME}
  vpc_public_images:
    requests:
    - url: https://${RIAS_REGION}.iaas.cloud.ibm.com/v1/images?version=${RIAS_VERSION}&generation=2&limit=99&sort=name'
      method: GET
      headers:
        Content-Type: application/json
        Accept: application/json
        Authorization: ${__P(auth_token)}
      label: get_public_images
      think-time: ${THINK_TIME}
  vpc_private_images:
    requests:
    - url: https://private-${RIAS_REGION}.iaas.cloud.ibm.com/v1/images?version=${RIAS_VERSION}&generation=2&limit=99&sort=name'
      method: GET
      headers:
        Content-Type: application/json
        Accept: application/json
        Authorization: ${__P(auth_token)}
      label: get_private_images
      think-time: ${THINK_TIME}
  vpc_public_volumes:
    requests:
    - url: https://${RIAS_REGION}.iaas.cloud.ibm.com/v1/volumes?version=${RIAS_VERSION}&generation=2&limit=99&sort=name'
      method: GET
      headers:
        Content-Type: application/json
        Accept: application/json
        Authorization: ${__P(auth_token)}
      label: get_public_volumes
      think-time: ${THINK_TIME}
  vpc_private_volumes:
    requests:
    - url: https://private-${RIAS_REGION}.iaas.cloud.ibm.com/v1/volumes?version=${RIAS_VERSION}&generation=2&limit=99&sort=name'
      method: GET
      headers:
        Content-Type: application/json
        Accept: application/json
        Authorization: ${__P(auth_token)}
      label: get_private_volumes
      think-time: ${THINK_TIME}
  vpc_test:
    requests:
    - if: ${__groovy(ctx.getThreadNum() == 0 && vars.getIteration() == 1,)}
      then:
      - include-scenario: iam_auth
      else:
      - include-scenario: vpc_public_instances
      - include-scenario: vpc_private_instances
      - include-scenario: vpc_public_lbs
      - include-scenario: vpc_private_lbs
      - include-scenario: vpc_public_images
      - include-scenario: vpc_private_images
      - include-scenario: vpc_public_volumes
      - include-scenario: vpc_private_volumes